{
  "npCommunicationId": "NPWR38251_00",
  "title": "Krispain Hero VR: Roguelite Dungeon Shooter Simulator",
  "platform": "PS5",
  "trophySetVersion": "01.00",
  "hasTrophyGroups": false,
  "totalItemCount": 21,
  "trophies": [
    {
      "trophyId": 0,
      "trophyHidden": false,
      "trophyType": "platinum",
      "trophyName": "Master of the Castle",
      "trophyDetail": "You've proven yourself to be a true champion, earning every trophy the game has to offer. Your skills, courage, and dedication have allowed you to conquer every challenge and emerge victorious. The people of the castle look up to you with admiration and respect, hailing you as a true hero and champion. May your legacy inspire future generations of gamers, Master of the Castle!",
      "trophyIconUrl": "https://psnobj.prod.dl.playstation.net/psnobj/NPWR38251_00/c65fe8c7-63aa-4c30-ad3d-9a215f34cf5a.png",
      "trophyGroupId": "default"
    },
    {
      "trophyId": 1,
      "trophyHidden": false,
      "trophyType": "bronze",
      "trophyName": "First Steps",
      "trophyDetail": "You've taken your first steps into the castle and started your journey as a hero. You've accepted the challenge to embark on a dangerous quest to save the kingdom from the evil forces that threaten it. Your journey has only just begun, but your determination and courage have set you on the path to greatness. May your quest be filled with many victories!",
      "trophyIconUrl": "https://psnobj.prod.dl.playstation.net/psnobj/NPWR38251_00/2ad0a998-a7c7-42af-b14a-474c966c7ee7.png",
      "trophyGroupId": "default"
    },
    {
      "trophyId": 2,
      "trophyHidden": false,
      "trophyType": "bronze",
      "trophyName": "Rat Exterminator",
      "trophyDetail": "You've eradicated 15 pesky rats that were scurrying around the castle walls. These rodents may have been small and insignificant, but they posed a threat to the safety of the people and creatures residing in the castle. Your swift and decisive action has proven that you have what it takes to face any challenge that comes your way. Keep up the good work, hero!",
      "trophyIconUrl": "https://psnobj.prod.dl.playstation.net/psnobj/NPWR38251_00/b5c16e70-bdf3-45a2-88b0-51faec4d1de0.png",
      "trophyGroupId": "default"
    },
    {
      "trophyId": 3,
      "trophyHidden": false,
      "trophyType": "bronze",
      "trophyName": "Lizard Slayer",
      "trophyDetail": "You've shown no mercy to the 10 lizards that were menacingly lurking in the shadows of the castle. These reptilian creatures were dangerous foes, but your skill and bravery prevailed. Your victory has earned you the respect and admiration of the people of the castle. May you continue to triumph over any obstacle that stands in your way!",
      "trophyIconUrl": "https://psnobj.prod.dl.playstation.net/psnobj/NPWR38251_00/064e7505-790f-4d25-aae6-fc41064a99b6.png",
      "trophyGroupId": "default"
    },
    {
      "trophyId": 4,
      "trophyHidden": false,
      "trophyType": "bronze",
      "trophyName": "Demon Hunter",
      "trophyDetail": "You've bravely taken down 10 flying demons that were terrorizing the castle. These supernatural creatures were formidable foes, but your quick reflexes and sharp aim allowed you to strike them down with ease. Your heroic deeds have not gone unnoticed, and the people of the castle are grateful for your valiant efforts. Keep up the good fight, hero!",
      "trophyIconUrl": "https://psnobj.prod.dl.playstation.net/psnobj/NPWR38251_00/3741531d-edc5-4c4f-988d-ecc2ccf56214.png",
      "trophyGroupId": "default"
    },
    {
      "trophyId": 5,
      "trophyHidden": false,
      "trophyType": "bronze",
      "trophyName": "Gateway Guardian",
      "trophyDetail": "You've unlocked the next room of the game and opened the gateway to new adventures. Your perseverance and determination have paid off, and you are now one step closer to your ultimate goal. The challenges ahead will be greater, but you have proven that you are up to the task. May you continue to grow stronger with each victory!",
      "trophyIconUrl": "https://psnobj.prod.dl.playstation.net/psnobj/NPWR38251_00/a8c6939e-5f14-4810-8229-a6939584167f.png",
      "trophyGroupId": "default"
    },
    {
      "trophyId": 6,
      "trophyHidden": false,
      "trophyType": "bronze",
      "trophyName": "Castle Explorer",
      "trophyDetail": "You've explored the castle yard and uncovered its secrets. Your curiosity and inquisitiveness have led you to discover hidden treasures and pathways that were unknown to others. Your dedication to your quest has earned you the admiration of the people of the castle. Keep exploring, hero!",
      "trophyIconUrl": "https://psnobj.prod.dl.playstation.net/psnobj/NPWR38251_00/8f01de23-d448-4b4d-802f-9dce4188b80d.png",
      "trophyGroupId": "default"
    },
    {
      "trophyId": 7,
      "trophyHidden": false,
      "trophyType": "silver",
      "trophyName": "Rat Rampage",
      "trophyDetail": "You've unleashed a fury upon 30 rats, crushing them beneath your might. The rats were no match for your growing strength and expertise, and you have shown the people of the castle that you are a force to be reckoned with. May your victories continue to mount, hero!",
      "trophyIconUrl": "https://psnobj.prod.dl.playstation.net/psnobj/NPWR38251_00/5c6915c6-b0c2-4af2-b60b-ecfc1fee08de.png",
      "trophyGroupId": "default"
    },
    {
      "trophyId": 8,
      "trophyHidden": false,
      "trophyType": "silver",
      "trophyName": "Lizard Annihilator",
      "trophyDetail": "You've shown no mercy to the 25 lizards that dared to cross your path. Your mastery of combat techniques and weaponry has allowed you to vanquish these reptilian foes with ease. Your growing reputation as a fierce warrior has earned you the respect and admiration of the people of the castle. Keep up the good fight, hero!",
      "trophyIconUrl": "https://psnobj.prod.dl.playstation.net/psnobj/NPWR38251_00/58104a82-8d1b-42c5-a5d2-bdfae076ca54.png",
      "trophyGroupId": "default"
    },
    {
      "trophyId": 9,
      "trophyHidden": false,
      "trophyType": "silver",
      "trophyName": "Demon Slayer",
      "trophyDetail": "You've battled and defeated 20 flying demons, sending them back to the depths of hell from which they came. Your fearlessness and determination have allowed you to prevail over these supernatural foes, and you have shown the people of the castle that you are a true hero. May your strength and courage continue to grow with each victory!",
      "trophyIconUrl": "https://psnobj.prod.dl.playstation.net/psnobj/NPWR38251_00/bcc95b86-3669-4a4e-8fcb-321b1003c7d7.png",
      "trophyGroupId": "default"
    },
    {
      "trophyId": 10,
      "trophyHidden": false,
      "trophyType": "silver",
      "trophyName": "Easy Rider",
      "trophyDetail": "You've arrived at the third room of the game with the \"Easy\" difficulty setting. Your persistence and skill have enabled you to overcome the challenges that lie ahead, and you are well on your way to achieving your goal. Your determination to succeed has earned you the admiration of the people of the castle. Keep pushing forward, hero!",
      "trophyIconUrl": "https://psnobj.prod.dl.playstation.net/psnobj/NPWR38251_00/e63104f0-d626-425a-9eed-c9c7c44c7e0a.png",
      "trophyGroupId": "default"
    },
    {
      "trophyId": 11,
      "trophyHidden": false,
      "trophyType": "silver",
      "trophyName": "Castle Crusader",
      "trophyDetail": "You've arrived at the fourth room of the game with the \"Easy\" difficulty setting. Your progress has been steady and your skills have improved with each challenge you've faced. Your bravery and dedication to your quest have earned you the respect and admiration of the people of the castle. May you continue to march forward with unwavering determination!",
      "trophyIconUrl": "https://psnobj.prod.dl.playstation.net/psnobj/NPWR38251_00/07d7953a-0178-4fa1-8237-d4dd37907bbe.png",
      "trophyGroupId": "default"
    },
    {
      "trophyId": 12,
      "trophyHidden": false,
      "trophyType": "silver",
      "trophyName": "Persistent Player",
      "trophyDetail": "You have spent 2 hours in the game continuously, showing remarkable focus and dedication. Your determination has allowed you to navigate challenging levels and overcome obstacles, earning the respect and admiration of your fellow players. Your commitment to the game is an inspiration to all, and we eagerly await to see what new achievements you will unlock.",
      "trophyIconUrl": "https://psnobj.prod.dl.playstation.net/psnobj/NPWR38251_00/bb02a190-6ff1-4498-bfef-fdd9d0e98300.png",
      "trophyGroupId": "default"
    },
    {
      "trophyId": 13,
      "trophyHidden": false,
      "trophyType": "gold",
      "trophyName": "Champion of the Fourth Realm",
      "trophyDetail": "You have reached the fourth room of the game on medium difficulty, demonstrating your exceptional skills and strategic prowess. The challenges you have faced along the way have honed your abilities and tested your resolve. As you continue your journey, we are confident that you will prove to be a worthy champion, feared by your enemies and revered by your allies. Congratulations on this outstanding achievement!",
      "trophyIconUrl": "https://psnobj.prod.dl.playstation.net/psnobj/NPWR38251_00/fa9950ed-7a33-441d-af74-c7e556dde312.png",
      "trophyGroupId": "default"
    },
    {
      "trophyId": 14,
      "trophyHidden": false,
      "trophyType": "gold",
      "trophyName": "Rat Genocide",
      "trophyDetail": "You've vanquished 100 rats, leaving no stone unturned in your mission to rid the castle of these vermin. Your skill and bravery have allowed you to become a formidable force to be reckoned with. The people of the castle praise your valiant efforts and celebrate your success. May your victories continue to multiply, hero!",
      "trophyIconUrl": "https://psnobj.prod.dl.playstation.net/psnobj/NPWR38251_00/ee671312-3946-4bac-b029-bf0f704ef121.png",
      "trophyGroupId": "default"
    },
    {
      "trophyId": 15,
      "trophyHidden": false,
      "trophyType": "gold",
      "trophyName": "Lizard Conqueror",
      "trophyDetail": "You've defeated 80 lizards, proving that you are a force to be reckoned with. Your courage and skill have allowed you to vanquish these reptilian foes with ease. The people of the castle look up to you as a hero and a symbol of hope. May your strength and valor continue to shine brightly!",
      "trophyIconUrl": "https://psnobj.prod.dl.playstation.net/psnobj/NPWR38251_00/d0017358-4d95-4f10-95d7-2f337497b5f7.png",
      "trophyGroupId": "default"
    },
    {
      "trophyId": 16,
      "trophyHidden": false,
      "trophyType": "gold",
      "trophyName": "Demon Exorcist",
      "trophyDetail": "You've banished 70 flying demons back to the netherworld, proving your strength and prowess as a warrior. Your courage and determination have allowed you to face these supernatural creatures head-on and emerge victorious. The people of the castle sing your praises and honor your name. May you continue to be a shining example of heroism, hero!",
      "trophyIconUrl": "https://psnobj.prod.dl.playstation.net/psnobj/NPWR38251_00/71e03574-44ff-40fa-a041-2eb966ce0513.png",
      "trophyGroupId": "default"
    },
    {
      "trophyId": 17,
      "trophyHidden": false,
      "trophyType": "gold",
      "trophyName": "Hardcore Hero",
      "trophyDetail": "You've arrived at the fourth room of the game with the \"Hard\" difficulty setting. The challenges ahead are daunting, but you are undaunted. Your skill and bravery are unmatched, and the people of the castle hold you in the highest regard. May your journey be filled with many victories, hero!",
      "trophyIconUrl": "https://psnobj.prod.dl.playstation.net/psnobj/NPWR38251_00/4462f3fc-d321-41e6-80d5-1ff6414b2411.png",
      "trophyGroupId": "default"
    },
    {
      "trophyId": 18,
      "trophyHidden": false,
      "trophyType": "gold",
      "trophyName": "Castle Champion",
      "trophyDetail": "You've arrived at the fifth room of the game with the \"Hard\" difficulty setting. You are now one step closer to your ultimate goal, and your victory is all the sweeter for the trials you've faced. Your unwavering dedication to your quest has earned you the respect and admiration of the people of the castle. May you continue to forge ahead with courage and determination, hero!",
      "trophyIconUrl": "https://psnobj.prod.dl.playstation.net/psnobj/NPWR38251_00/90ee7eb3-e46b-4561-93d1-718c7e23bb77.png",
      "trophyGroupId": "default"
    },
    {
      "trophyId": 19,
      "trophyHidden": false,
      "trophyType": "gold",
      "trophyName": "Fifth Floor Finisher",
      "trophyDetail": "You've successfully passed the fifth room of the game with the \"Hard\" difficulty setting. The challenges were great, but your skill and determination allowed you to emerge victorious. The people of the castle hail you as a true hero and a master of your craft. May your triumphs continue to inspire others, hero!",
      "trophyIconUrl": "https://psnobj.prod.dl.playstation.net/psnobj/NPWR38251_00/d7dd17fb-f43e-4782-9b2b-e96e0386e2d7.png",
      "trophyGroupId": "default"
    },
    {
      "trophyId": 20,
      "trophyHidden": false,
      "trophyType": "gold",
      "trophyName": "Gaming Gladiator",
      "trophyDetail": "You've been in the game for five hours straight, proving your stamina and endurance. Your dedication to your quest is unparalleled, and you refuse to back down from any challenge. The people of the castle hold you in the highest esteem and marvel at your strength and tenacity. May your name go down in the annals of gaming history, hero!",
      "trophyIconUrl": "https://psnobj.prod.dl.playstation.net/psnobj/NPWR38251_00/760ff7f9-7b40-48c9-9b75-309e08abbd56.png",
      "trophyGroupId": "default"
    }
  ]
}